the-this-pointer/timer-board-stm32f103/Core/Src/UserInterface.c
	SCR_DIRTY_ARG(hnd);
	return 1;
}

void mainPageInputCallback(void* uih, enum ActionType action)
{
	switch(action)
	{
		case Key1:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[SettingPageIdx]);
			break;
		case Key4:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[TimeListPageIdx]);
			break;
		default:
			break;
	}
}

void timeListPageOnInitCallback(void* uih)
{
	UiHandle* hnd = uih;
	TimeListPageData* data = hnd->currentPage->data;

	Timer_Sort(timeList);
	
	data->plan = TimePlan_IsEmpty(&timeList->plans[0])? Timer_GetNextFullSlot(timeList, 0): &timeList->plans[0];
	data->screenIndex = 0;
	data->showingItem = NULL;
}

void timeListPageOnLeaveCallback(void* uih)
{
	Timer_Sort(timeList);
}

// use odd numbers if you don't want a blink between first screen update!
#define TIME_TO_SHOW_PLAN 5
uint8_t timeListPageUpdateCallback(void* uih, uint32_t since)
{
	if (since < 800)
		return 0;
	UiHandle* hnd = uih;
	TimeListPageData* data = hnd->currentPage->data;
			
	ssd1306_Fill(Black);
	if (data->plan == NULL)
	{
		ssd1306_SetCursor(5, 5);
		ssd1306_WriteString("Empty List!", Font_11x18, White);
		SCR_DIRTY_ARG(hnd);
	} else {
		char buff[16] = {0};

		if (data->screenIndex <= TIME_TO_SHOW_PLAN)
		{
			switch(data->plan->mode)
			{
				case Monthly:
					snprintf(buff, 16, "%c: %d", g_timeModes[data->plan->mode], data->plan->day);
					break;
				case Weekly:
					snprintf(buff, 16, "%c: %s", g_timeModes[data->plan->mode], g_weekDays[data->plan->day]);
					break;
				default:
					snprintf(buff, 16, "%c", g_timeModes[data->plan->mode]);
			}
	
			ssd1306_SetCursor(5, 5);
			ssd1306_WriteString(buff, Font_11x18, White);
		}
		else if (data->screenIndex % 2 == 0)
		{
			uint8_t offset = TimePlan_ToOffset(data->plan, data->showingItem);
			if (offset == INVALID_SLOT)
				offset = MAX_TIMES_PER_PLAN + 1;

			data->showingItem = TimePlan_GetNextFullSlot(data->plan, offset);
		}
		
		if (data->screenIndex > TIME_TO_SHOW_PLAN && data->showingItem != NULL)
		{
			snprintf(buff, 16, "%02d:%02d [%s]", data->showingItem->hours, data->showingItem->minutes, data->showingItem->status? "On": "Off");
			ssd1306_SetCursor(5, 5);
			ssd1306_WriteString(buff, Font_11x18, White);
		}
		else if (data->screenIndex > TIME_TO_SHOW_PLAN && data->showingItem == NULL)
		{
			data->screenIndex = 0;
			snprintf(buff, 16, "Nothing Yet!");
			ssd1306_SetCursor(5, 5);
			ssd1306_WriteString(buff, Font_11x18, White);
		}
	}
	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	SCR_DIRTY_ARG(hnd);

	data->screenIndex += 1;
	data->screenIndex %= 254;
	return 1;
}

void timeListPageInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	TimeListPageData* data = hnd->currentPage->data;

	switch(action)
	{
		case Key1:
			ACT_OFST_3(
							UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[MainPageIdx]), 
		
							g_menuActionsOffset -= 4,
		
							g_menuActionsOffset -= 4
			)
			break;
		case Key2:
		{
			ACT_OFST_3(
							data->screenIndex = 0;
							data->showingItem = NULL;
							TimePlan* p = Timer_GetPrevFullSlot(timeList, Timer_ToOffset(timeList, data->plan)); 
							if(p) data->plan = p, 

							((AddTimePlanPageData*)(hnd->pages[AddTimePlanPageIdx].data))->editingPlan = NULL;
							UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[AddTimePlanPageIdx]),
							
							if (data->screenIndex <= TIME_TO_SHOW_PLAN && data->plan) {
								((AddTimePlanPageData*)(hnd->pages[AddTimePlanPageIdx].data))->editingPlan = data->plan;
								UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[AddTimePlanPageIdx]);
							}
							else if (data->screenIndex > TIME_TO_SHOW_PLAN && data->showingItem != NULL)
							{
								((AddTimerItemPageData*)(hnd->pages[AddTimerItemPageIdx].data))->plan = data->plan;
								((AddTimerItemPageData*)(hnd->pages[AddTimerItemPageIdx].data))->editingItem = data->showingItem;
								UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[AddTimerItemPageIdx]);
							}
							else if (data->screenIndex > TIME_TO_SHOW_PLAN && data->plan)
							{
								((AddTimerItemPageData*)(hnd->pages[AddTimerItemPageIdx].data))->plan = data->plan;
								((AddTimerItemPageData*)(hnd->pages[AddTimerItemPageIdx].data))->editingItem = NULL;
								UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[AddTimerItemPageIdx]);
							}
			)
			break;
		}
		case Key3:
			ACT_OFST_3(
							data->screenIndex = 0;
							data->showingItem = NULL;
							TimePlan* p = Timer_GetNextFullSlot(timeList, Timer_ToOffset(timeList, data->plan)); 
							if(p) data->plan = p, 

							Timer_RemovePlan(timeList, Timer_ToOffset(timeList, data->plan)); 
							data->plan = Timer_GetNextFullSlot(timeList, Timer_ToOffset(timeList, data->plan)),
							
							Timer_SaveData(&timeListData);
							UserInterface_ShowPopup(uih, "Saved!", 3, &((UiHandle*)uih)->pages[TimeListPageIdx]);
			)
			break;
		case Key4:
			ACT_OFST_3(
							g_menuActionsOffset += 4, 
		
							g_menuActionsOffset += 4, 
		
							;
			)
			break;
		default:
			break;
	}
}

void addTimePlanPageOnInitCallback(void* uih)
{
	UiHandle* hnd = uih;
	AddTimePlanPageData* data = hnd->currentPage->data;

	data->settingStep = 0;
	if (data->editingPlan == NULL)
	{
		data->plan.day = 0;
		data->plan.mode = Daily;
		
		int i;
		for (i = 0; i < MAX_TIMES_PER_PLAN; i++)
			TimePlan_RemoveItem(&data->plan, i);
	} else {
		data->plan.day = data->editingPlan->day - (data->editingPlan->mode == Monthly? 1: 0);
		data->plan.mode = data->editingPlan->mode;
	}
}

uint8_t addTimePlanPageUpdateCallback(void* uih, uint32_t since)
{
	if (since < 400)
		return 0;
	
	UiHandle* hnd = uih;
	AddTimePlanPageData* data = hnd->currentPage->data;

	ssd1306_Fill(Black);
	ssd1306_SetCursor(5, 5);

	char buff[24] = {0};
	switch(data->settingStep)
	{
		case 0:	//setting plan mode
		{
			snprintf(buff, 24, "Mode: %c", g_timeModes[data->plan.mode]);
			break;
		}
		case 1: //setting day if mode is w/m
		{
			if (data->plan.mode == Weekly)
			{
				snprintf(buff, 24, "Day: %s", g_weekDays[data->plan.day]);
			}
			else if (data->plan.mode == Monthly)
			{
				snprintf(buff, 24, "Day: %d", data->plan.day+1);
			}
			break;
		}
	}
	ssd1306_WriteString(buff, Font_11x18, White);
	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	
