the-this-pointer/timer-board-stm32f103/Core/Src/UserInterface.c
		// should set date
		ssd1306_SetCursor(5, 5);
		ssd1306_WriteString(dateBuff, Font_11x18, White);
	}
	else if (data->settingStep == 1)
	{
		ssd1306_SetCursor(5, 5);
		ssd1306_WriteString(g_weekDays[data->sDate->WeekDay], Font_11x18, White);
	}
	else if (data->settingStep == 2)
	{
		char timeBuff[16] = {0};
		char ptr[5] = {' ', ' ', ' ', ' ', '\0'};
		if (data->updateStep == 0) {
			ptr[0] = '[';
			ptr[1] = ']';
		}
		else if (data->updateStep == 1) {
			ptr[2] = '[';
			ptr[3] = ']';
		}
		snprintf(timeBuff, 16, "%c%02d%c:%c%02d%c", ptr[0], _D(data->sTime->Hours), ptr[1], 
																								ptr[2], _D(data->sTime->Minutes), ptr[3]);

		// should set time
		ssd1306_SetCursor(5, 5);
		ssd1306_WriteString(timeBuff, Font_11x18, White);
	}

	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	
	SCR_DIRTY_ARG(hnd);
	return 1;
}

void setTimePageInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	SetTimePageData* data = hnd->currentPage->data;

	switch(action)
	{
		case Key1:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[SettingPageIdx]);
			break;
		case Key2:
			if (data->settingStep == 0)
			{
				data->updateStep == 0 && (data->sDate->Year = _E((_D(data->sDate->Year) + 99 - 1) % 99));
				data->updateStep == 1 && (data->sDate->Month = _E((_D(data->sDate->Month) + 12 - 1) % 12));
				data->updateStep == 2 && (data->sDate->Date = _E((_D(data->sDate->Date) + 31 - 1) % 31));
			}
			else if (data->settingStep == 1)
			{
				data->sDate->WeekDay = _E((_D(data->sDate->WeekDay) + 7 - 1) % 7);
			}
			else if (data->settingStep == 2)
			{
				data->updateStep == 0 && (data->sTime->Hours = _E((_D(data->sTime->Hours) + 24 - 1) % 24));
				data->updateStep == 1 && (data->sTime->Minutes = _E((_D(data->sTime->Minutes) + 60 - 1) % 60));
			}
			break;
		case Key3:
			if (data->settingStep == 0)
			{
				data->updateStep == 0 && (data->sDate->Year = _E((_D(data->sDate->Year) + 1) % 99));
				data->updateStep == 1 && (data->sDate->Month = _E((_D(data->sDate->Month) + 1) % 12));
				data->updateStep == 2 && (data->sDate->Date = _E((_D(data->sDate->Date) + 1) % 31));
			}
			else if (data->settingStep == 1)
			{
				data->sDate->WeekDay = (data->sDate->WeekDay + 1) % 7;
			}
			else if (data->settingStep == 2)
			{
				data->sTime->Seconds = 0;
				data->updateStep == 0 && (data->sTime->Hours = _E((_D(data->sTime->Hours) + 1) % 24));
				data->updateStep == 1 && (data->sTime->Minutes = _E((_D(data->sTime->Minutes) + 1) % 60));
			}
			break;
		case Key4:
			if (data->settingStep == 0)
			{
				data->updateStep = (data->updateStep + 1) % 3;
				if (data->updateStep == 0)
					data->settingStep++;
			}
			else if (data->settingStep == 1)
			{
				data->settingStep++;
			}
			else if (data->settingStep == 2)
			{
				data->updateStep = (data->updateStep + 1) % 2;
				if (data->updateStep == 0) {
					if (HAL_RTC_SetDate(&hrtc, data->sDate, RTC_FORMAT_BCD) != HAL_OK || HAL_RTC_SetTime(&hrtc, data->sTime, RTC_FORMAT_BCD) != HAL_OK)
						Error_Handler();
					else
						UserInterface_ShowPopup(uih, "Time Set!", 3, &((UiHandle*)uih)->pages[SettingPageIdx]);
				}
			}
			break;
		default:
			break;
	}
}

void setSleepTimePageOnInitCallback(void* uih)
{
	UiHandle* hnd = uih;
	SetSleepTimePageData* data = hnd->currentPage->data;

	data->sleepTime = sleepTimeMSec / 1000;
}

uint8_t setSleepTimePageUpdateCallback(void* uih, uint32_t since)
{
	if (since < 300)
		return 0;
	
	UiHandle* hnd = uih;
	SetSleepTimePageData* data = hnd->currentPage->data;
	
	ssd1306_Fill(Black);

	char timeBuff[8] = {0};
	snprintf(timeBuff, 8, "%d", data->sleepTime);
	
	ssd1306_SetCursor(5, 5);
	ssd1306_WriteString(timeBuff, Font_11x18, White);

	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	SCR_DIRTY_ARG(hnd);
	return 1;
}

void setSleepTimePageInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	SetSleepTimePageData* data = hnd->currentPage->data;

	switch(action)
	{
		case Key1:
			UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[SettingPageIdx]);
			break;
		case Key2:
			if (data->sleepTime == 6)
				data->sleepTime = 60;
			else
				data->sleepTime--;
			break;
		case Key3:
			if (data->sleepTime == 60)
				data->sleepTime = 6;
			else
				data->sleepTime++;
			break;
		case Key4:
			if (xTimerChangePeriod(sleepTimerHandle, data->sleepTime * 1000 / portTICK_PERIOD_MS, 100) == pdPASS && 
				EE_WriteVariable(VirtAddVarTab[0],  data->sleepTime * 1000) == HAL_OK)
			{
				sleepTimeMSec = data->sleepTime * 1000;
				UserInterface_ShowPopup(uih, "Time Set!", 3, &((UiHandle*)uih)->pages[SettingPageIdx]);
			}
			else
				Error_Handler();
			break;
		default:
			break;
	}
}

void sendTimesPageOnInitCallback(void* uih)
{
	UiHandle* hnd = uih;
	SendTimesPageData* data = hnd->currentPage->data;
	
	data->state = Init;
}

void sendTimesPageOnLeaveCallback(void* uih)
{
}

uint8_t sendTimesPageUpdateCallback(void* uih, uint32_t since)
{
	if (since < 400)
		return 0;
	
	UiHandle* hnd = uih;
	SendTimesPageData* data = hnd->currentPage->data;

	/**
	* Sending time to other devices has this steps:
	* 0 . if we have dma/uart enabled, disable that (init page callback)
	* 1.cmp;
	* 2.hlt;
	* 3.clr;
	* 4.multiple dta; s...
	* 5.set;
	* 6.stt;
	* 7 . re-enable dma/uart if we had it (leave page callback)
	* In every step, there is a change of rejection in receiver side which will fail the remaining process.
	*/
	
	char buff[32];
	uint8_t cmdRes = 0x00;	// non-zero value means error occured
	if (data->state < ErrorOffset)
	{
		if (data->state != Cancel && data->state != Success)
			data->state++;
		
		switch (data->state)
		{
			case Init:
			case CompatCheck:
			{
				char cmdData[3] = {MAX_PLANS, MAX_TIMES_PER_PLAN, UART_BUFF_SIZE};
				cmdRes = sendUartCommand("cmp:", cmdData, 3);
				break;
			}
			case Halt:
				cmdRes = sendUartCommand("hlt;", NULL, 0);
				break;
			case Clr:
				cmdRes = sendUartCommand("clr;", NULL, 0);
				break;
			case SendTime:
				break;
			case Save:
				cmdRes = sendUartCommand("set;", NULL, 0);
				break;
			case Start:
				cmdRes = sendUartCommand("stt;", NULL, 0);
				break;
			case Success:
				break;
			case Cancel:
				break;
			default:
				break;
		}
		
