the-this-pointer/timer-board-stm32f103/Core/Src/UserInterface.c
		if (cmdRes)
			data->state += ErrorOffset;			
	}
	
		switch (data->state)
		{
			case Init:
			case CompatCheck:
				strcpy(buff, "Checking compat");
				break;
			case Halt:
				strcpy(buff, "Halting device");
				break;
			case Clr:
				strcpy(buff, "Clearing");
				break;
			case SendTime:
				strcpy(buff, "Sending");
				break;
			case Save:
				strcpy(buff, "Saving");
				break;
			case Start:
				strcpy(buff, "Starting");
				break;
			case Success:
				strcpy(buff, "Success!");
				break;
			case Cancel:
				strcpy(buff, "Cancelled!");
				break;
			case ErrorOffset:
				strcpy(buff, "[Error]");
				break;
			case CompatError:
				strcpy(buff, "Not compatible!");
				break;
			case HaltError:
				strcpy(buff, "Halt error!");
				break;
			case ClrError:
				strcpy(buff, "Clear error!");
				break;
			case SendTimeError:
				strcpy(buff, "Send error!");
				break;
			case SaveError:
				strcpy(buff, "Save error!");
				break;
			case StartError:
				strcpy(buff, "Start error!");
				break;
			default:
				break;
		}
	
	ssd1306_SetCursor(5, 5);
	ssd1306_WriteString(buff, Font_11x18, White);

	UserInterface_p_DrawActions(hnd->currentPage->actionIcons);
	SCR_DIRTY_ARG(hnd);
}

void sendTimesPageInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	SendTimesPageData* data = hnd->currentPage->data;

	switch(action)
	{
		case Key1:
			if (data->state > ErrorOffset || data->state == Cancel || data->state == Success)
				UserInterface_ChangePage(uih, &((UiHandle*)uih)->pages[SettingPageIdx]);
			else if (data->state != Cancel)
				data->state = Cancel;
			break;
		case Key2:
			break;
		case Key3:
			break;
		case Key4:
			break;
		default:
			break;
	}
}

void messagePopupOnInitCallback(void* uih)
{
	UiHandle* hnd = uih;
	MessagePopupData* data = hnd->currentPage->data;

	data->secondCounter = 0;
}

uint8_t messagePopupUpdateCallback(void* uih, uint32_t since)
{
	if (since < 950)
		return 0;
	
	UiHandle* hnd = uih;
	MessagePopupData* data = hnd->currentPage->data;
	if (++data->secondCounter >= data->secondsToShow)
		UserInterface_ChangePage(uih, data->fallbackPage);
	
	return 1;
}

void messagePopupInputCallback(void* uih, enum ActionType action)
{
	UiHandle* hnd = uih;
	MessagePopupData* data = hnd->currentPage->data;

	UserInterface_ChangePage(uih, data->fallbackPage);
}

/* void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) 
{
  // if we receive bytes more than the buffer size, we will ignore them unless we may loose them...
  // HAL_UART_Receive_DMA(&huart1, g_uart_rx, UART_BUFF_SIZE);
} */

uint8_t sendUartCommand(const char* cmd, void* data, uint8_t length)
{
	uint8_t buff[5] = {0};
	buff[0] = UART_START_PACKET;
	buff[1] = UART_START_PACKET_2;
	buff[2] = strlen(cmd) + length;
	
	// send command header first
	HAL_UART_Transmit(&huart1, buff, 3, 100);
	// send the payload
	HAL_UART_Transmit(&huart1, (uint8_t*)cmd, strlen(cmd), 100);
	if (data != NULL && length > 0)
		HAL_UART_Transmit(&huart1, (uint8_t*)data, length, 100);
	// wait for response from receiver
	HAL_StatusTypeDef cmdRes = HAL_UART_Receive(&huart1, buff, 4, 1000);
	if (cmdRes != HAL_OK || strlen((const char *)buff) < 4)
		return 0x01;
	return memcmp(buff, "ack;", 4);
}

uint8_t sendUartCommandChunked(const char* cmd, void* data, uint16_t length)
{
	uint16_t offset = 0x00;
	// maximum payload length we can send in chunked format
	uint8_t maxPayloadLen = UART_BUFF_SIZE - 3 - strlen(cmd) - 2; // 3 => size of header, 2 => offset and length bytes
	
	while (offset < length)
	{
		uint8_t dataToSendLen = (length - offset > maxPayloadLen)? maxPayloadLen: length - offset;
		
		memset(g_uart_rx, 0x00, UART_BUFF_SIZE);
		g_uart_rx[0] = offset;
		g_uart_rx[1] = dataToSendLen;
		memcpy(g_uart_rx, data + offset, dataToSendLen);
		uint8_t res = sendUartCommand(cmd, g_uart_rx, dataToSendLen);
		if (res != 0x00)
			return res;
		offset += dataToSendLen;
	}
	return 0x00;
}

void processUartCommand(const char* data, uint8_t length)
{
	if (length < 4)
		return;
	
	uint8_t handled = 0x00;
	if (memcmp(data, "hlt;", 4) == 0)
	{
		// stop timer task (but outputs stay active with last values)
		g_timerEnabled = 0x00;
		handled = 0x01;
	}
	else if (memcmp(data, "stt;", 4) == 0)
	{
		// start timer task
		g_timerEnabled = 0x01;
		handled = 0x01;
	}
	else if (memcmp(data, "clr;", 4) == 0)
	{
		// clear all items
		timeListData.maxPlans = 0;
		timeListData.maxTimePerPlan = 0;

		Timer_TimeListInit(timeList);
		handled = 0x01;
	}
	else if (memcmp(data, "set;", 4) == 0)
	{
		// save all items
		Timer_SaveData(&timeListData);
		handled = 0x01;
	}
	else if (memcmp(data, "cmp:", 4) == 0)
	{
		// check if we have compatibility with setter device
		uint8_t maxPlans, maxTimesPerPlan, uartBuffSize;
		maxPlans = data[4];
		maxTimesPerPlan = data[5];
		uartBuffSize = data[6];

		if (uartBuffSize <= UART_BUFF_SIZE || maxPlans != MAX_PLANS || maxTimesPerPlan == MAX_TIMES_PER_PLAN)
			goto send_response;
		
		handled = 0x01;
	}
	else if (memcmp(data, "dta:", 4) == 0)
	{
		// chunk of data received
		
		uint8_t offset, len;
		offset = data[4];
		len = data[5];
		if (len >= length)
			goto send_response;
		memcpy(&timeListData + offset, data + 6, len);
		handled = 0x01;
	}
	
send_response:
	if (handled)
		HAL_UART_Transmit(&huart1, (uint8_t*)"ack;", 4, 10);
	else
		HAL_UART_Transmit(&huart1, (uint8_t*)"rej;", 4, 10);
}
